---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.GetEnumerator
source: html/7ec1dc27-5043-9807-a0a1-c2ee1eb79e3f.htm
---
# Autodesk.Revit.DB.CombinableElementArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.